foamCases/URANS-kOmega/SpecifiedVel-2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Boundary
    {
        type           zeroGradient;

    }

    Head-1
    {
        type           noSlip;
    }

    Head-2
    {
        type           noSlip;
    }

    Mouth
    {
        type            turbulentInlet;
        fluctuationScale (0.01 0.01 0.01);
        referenceField  uniform (0 0.1 0);
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
