foamCases/URANS-kOmega/SpecifiedVel-2D/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5;

boundaryField
{

    Boundary
    {
        type            zeroGradient;
    }

    Head-1
    {
        type            omegaWallFunction;
        value           uniform 5;
    }

    Head-2
    {
        type            omegaWallFunction;
        value           uniform 5;
    }

    Mouth
    {
        type            fixedValue;
        value           uniform 5;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //