foamCases/URANS-kOmega/SpecifiedVel-2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         150.0;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    //#includeFunc mag(U)
    
    /*probes
    {
        type                probes;
        functionObjectLibs  ("libsampling.so");
        enabled             true;
        outputControl       timeStep;
        outputInterval      1;

        fields (mag(U));

        probeLocations
        (
          (-0.1 0.85 0.005)
          (0 0.85 0.005)
          (0.1 0.85 0.005)
        );*/
    }
}

// ************************************************************************* //
